const navLinks = [
  {
    name: 'Интро',
    link: '#hero',
  },
  {
    name: 'Проекты',
    link: '#projects',
  },
  {
    name: 'Опыт',
    link: '#experience',
  },
  {
    name: 'Подход',
    link: '#approach',
  },
  {
    name: 'Навыки',
    link: '#skills',
  },
  {
    name: 'Связь',
    link: '#contact',
  },
];

const words = [
  { text: 'Идеи', imgPath: '/images/ideas.svg' },
  { text: 'Концепты', imgPath: '/images/concepts.svg' },
  { text: 'Дизайны', imgPath: '/images/designs.svg' },
  { text: 'Код', imgPath: '/images/code.svg' },
  { text: 'Фантазии', imgPath: '/images/ideas.svg' },
  { text: 'Креатив', imgPath: '/images/concepts.svg' },
  { text: 'Наброски', imgPath: '/images/designs.svg' },
  { text: 'Желания', imgPath: '/images/code.svg' },
];

const expCards = [
  {
    review:
      'Опыт работы с Павлом был потрясающим. Он быстро адаптировался к нашей команде и внес значительный вклад в наши проекты.',
    imgPath: '/images/exp1.svg',
    logoPath: '/images/logo1.png',
    title: 'Frontend Developer',
    date: '🗓️ Февраль 2024 - Настоящее время',
    responsibilities: [
      'Оптимизировал производительность.',
      'Идентифицировал и устранил критические баги.',
      'Разработал модуль AI.',
    ],
  },
  {
    review: 'Вторая рекомендация Вторая рекомендация Вторая рекомендация Вторая рекомендация',
    imgPath: '/images/exp2.svg',
    logoPath: '/images/logo2.png',
    title: 'Frontend Developer',
    date: '🗓️ Май 2022 - Февраль 2024',
    responsibilities: [
      'Переработал и улучшил существующий код.',
      'Разработал и внедрил новые функции для улучшения пользовательского опыта.',
      'Реализовал интеграцию с внешними сервисами.',
    ],
  },
  {
    review: 'Третья рекомендация Третья рекомендация Третья рекомендация Третья рекомендация',
    imgPath: '/images/exp3.svg',
    logoPath: '/images/logo3.png',
    title: 'Web Developer',
    date: '🗓️ Сентябрь 2020 - Май 2022',
    responsibilities: [
      'Поддержка и 5+ дочерних сайтов',
      'Создание промо-лендингов',
      'Реализовал интеграцию с внешними сервисами.',
    ],
  },
  {
    review: 'Хорошо отучился',
    imgPath: '/images/exp4.png',
    logoPath: '/images/logo4.png',
    title: 'Бакалавр Прикладной Информатики',
    date: 'Тольяттинский Государственный Университет',
    responsibilities: [],
  },
];

const featureLists = ['Удобство пользователя', 'Сила команды', 'Постоянное развитие'];

const goodLists = ['Ценность для бизнеса', 'Качество кода', 'Соблюдение сроков'];

const feedbacks = [
  {
    name: 'Александр Радюшин',
    position: 'Founder and CEO of Power Thesaurus',
    review:
      'Отличное чувство баланса между скоростью и качеством. Павел умеет быстро разбираться в незнакомом коде, аккуратно улучшая его, не ломая существующую логику. Такой разработчик повышает общий уровень команды.',
    imgPath: '/images/alex.jpg',
    icon: '💪',
  },
  {
    name: 'Анастасия Быкова',
    position: 'Старший QA. Рамблер',
    review:
      'Очень аккуратный разработчик, всегда тестирует свой код и помогает находить логические несостыковки ещё до релиза. Общение с ним лёгкое, без формальностей — всегда можно быстро договориться и решить любой вопрос.',
    imgPath: '/images/nastya.jpg',
    icon: '🔥',
  },
  {
    name: 'Сергей Бутузов',
    position: 'TechLead. Mercury Development',
    review:
      'Ответственный и внимательный к деталям специалист. Если он берёт задачу — можно быть уверенным, что она будет выполнена в срок, с продуманным UX и чистым кодом. Приятно видеть такой профессиональный подход.',
    imgPath: '/images/sergey.jpg',
    icon: '🚀',
  },
];

const stickers = [
  {
    title: 'To Do',
    description: 'Анализирую требования и цели',
  },
  {
    title: 'In Progress',
    description: 'Пишу надёжный, понятный код',
  },
  {
    title: 'Code Review',
    description: 'Открыт к обсуждению и улучшениям',
  },
  {
    title: 'Ready for Release',
    description: 'Готово к внедрению без доработок',
  },
];

export { words, navLinks, expCards, featureLists, goodLists, feedbacks, stickers };
